<?php
/**************************************************************************************

	file:			defs.php
	purpose:		所有设置都在此文件中

**************************************************************************************/

/******************************************************************************
	加密使用的字符串
*/
	$salt = "date:100805,contact:patrick.woolhoo@gmail.com";

	
/******************************************************************************
	网站使用的语言
*/
	$_lang = "en";


	$webTitle = "Nernet Automation Systems S.A.C";

	
/******************************************************************************
	DEBUG 标识控制mysql类执行时是否输出错误信息，
	DEBUG 分为4级 0, 1, 2, 3, 根据错误级别的不同而显示，
	0 不显示任何错误信息、警告、提示
	1 显示错误信息、警告、提示
	2 显示错误信息、警告、提示，以及引发错误的原因
	3 显示完整错误、警告、提示、引发错误的原因，以及当前状态
*/
	define('DEBUG', 3);


/******************************************************************************
	数据库连接信息
	程序启动后会自动建立以 $_db[$_useDb] 的连接信息的数据库对象，
	如有其他
*/
	$_db = array(
		'test' => array(
			'driver' => 'mysql',
			'persistent' => false,
			/*'host' => '68.178.142.109',
			'login' =>'nernet150909',
			'password' => 'Ners@06815871',*/
			
			'host' => 'localhost',
			'login' =>'root',
			'password' => '',
			'database' => 'nernet150909',
			'prefix' => '',
			'encoding' => 'utf8',
		),
		'default' => array(
			'driver' => 'mysql',
			'persistent' => false,
			/*'host' => '68.178.142.109',
			'login' => 'nernet150909',
			'password' => 'Ners@06815871',*/

			'host' => 'localhost',
			'login' =>'root',
			'password' => '',
			'database' => 'nernet150909',
			'prefix' => '',
			'encoding' => 'utf8',
		),
	);


/******************************************************************************
	$_useDb		主要用来进行数据库操作的数据库连接信息
				程序启动后会自动建立以此名称为数据库的数据库操作对象
*/
	$_useDb = 'default';


/******************************************************************************
	$_dbEngine	默认使用的数据库类型，此名称必须和libs/db/下面的文件名一致
*/
	$_dbEngine = 'mysql';


/******************************************************************************
	upload_formats		允许上传的文件类型2009-6-16 11:48，预置元素全部使用小写
*/
	$upload_formats = array(
		'txt', 
		'flv', 
		'gif', 
		'jpg', 
		'jpeg', 
		'bmp', 
		'png', 
		'doc', 
		'docx', 

	);


/******************************************************************************
	rewrite_ext			伪静态扩展名
*/
	$rewrite_ext = '.php';






/*=============================================================================
	下面内容无特殊需求无需改动
	所有记录的 DIR 都是物理路径
	所有记录的 PATH 都是虚拟路径
=============================================================================*/

	if (!defined('DS')) {
		define('DS', DIRECTORY_SEPARATOR);
	}

/******************************************************************************
	APP_DIR		web 的物理路径
*/
	if (!defined('APP_DIR')) {
		define('APP_DIR', dirname(dirname(__FILE__)));
	}
	
	
/******************************************************************************
	LIB_DIR		libs 的物理路径
*/
	if (!defined('LIB_DIR')) {
		define('LIB_DIR', dirname(__FILE__));
	}
	
	
/******************************************************************************
	APP_ID		作为APP的一个逻辑名字，用作网站的uid，主要用在cookie等的标识
*/
	if (!defined('APP_ID')) {
		define('APP_ID', "APPID_" . basename(dirname(dirname(__FILE__))));
	}
	

/******************************************************************************
	WEB_ROOT			用来记录网站运行的虚拟根目录，用此目录可以生成网络路径，此目录由'/'开始后面跟着网站所在的目录
						如/app
*/
	$docRoot = $_SERVER['DOCUMENT_ROOT'];
	$webPath = str_replace(DS, "/", dirname(dirname(__FILE__)));

	if (!defined('WEB_ROOT')) {
		define('WEB_ROOT', substr($webPath, strlen($docRoot)));
	}

	
/******************************************************************************
	ADMIN_DIR_NAME			用来记录管理文件夹名称，只是一个单独名称，不是路径，默认为admin
*/
	if (!defined('ADMIN_DIR_NAME')) {
		define('ADMIN_DIR_NAME', 'admin');
	}


/******************************************************************************
	ADMIN_DIR			用来记录管理文件夹物理路径
*/
	if (!defined('ADMIN_DIR')) {
		define('ADMIN_DIR', dirname(dirname(__FILE__)) . DS . ADMIN_DIR_NAME);
	}

	
/******************************************************************************
	ADMIN_PATH			用来记录管理文件夹虚拟路径
*/
	if (!defined('ADMIN_PATH')) {
		define('ADMIN_PATH', WEB_ROOT . "/" . ADMIN_DIR_NAME);
	}

	
/******************************************************************************
	ADMIN_SIGNIN_PATH			后台登陆虚拟路径
*/
	if (!defined('ADMIN_SIGNIN_PATH')) {
		define('ADMIN_SIGNIN_PATH', ADMIN_PATH . "/signin");
	}

	
/******************************************************************************
	ADMIN_SIGNOUT_PATH			后台注销虚拟路径
*/
	if (!defined('ADMIN_SIGNOUT_PATH')) {
		define('ADMIN_SIGNOUT_PATH', WEB_ROOT . "/signout");
	}

?>